xml/gupnp-set-uri

<?xml version="1.0"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <u:SetAVTransportURI xmlns:u="urn:schemas-upnp-org:service:AVTransport:1">
      <InstanceID>0</InstanceID>
      <CurrentURI>http://10.0.0.4:44444/RygelHTTPServer/GstLaunch/item/cHVsc2U%3D/transcoded/LPCM</CurrentURI>
      <CurrentURIMetaData>
        <DIDL-Lite xmlns="urn:schemas-upnp-org:metadata-1-0/DIDL-Lite/" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:upnp="urn:schemas-upnp-org:metadata-1-0/upnp/">
          <item id="pulse" parentID="0" restricted="0">
            <dc:title>Audio from blip</dc:title>
            <upnp:class>object.item.audioItem</upnp:class>
            <res importUri="http://10.0.0.4:44444/RygelHTTPServer/GstLaunch/item/cHVsc2U%3D" protocolInfo="http-get:*:audio/x-wav:*">http://10.0.0.4:44444/RygelHTTPServer/GstLaunch/item/cHVsc2U%3D</res>
            <res bitrate="176400" bitsPerSample="16" nrAudioChannels="2" protocolInfo="http-get:*:audio/L16;rate=44100;channels=2:DLNA.ORG_PN=LPCM;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=01100000000000000000000000000000" sampleFrequency="44100">http://10.0.0.4:44444/RygelHTTPServer/GstLaunch/item/cHVsc2U%3D/transcoded/LPCM</res>
            <res bitrate="32000" protocolInfo="http-get:*:audio/mpeg:DLNA.ORG_PN=MP3;DLNA.ORG_CI=1;DLNA.ORG_FLAGS=01100000000000000000000000000000">http://10.0.0.4:44444/RygelHTTPServer/GstLaunch/item/cHVsc2U%3D/transcoded/MP3</res>
          </item>
        </DIDL-Lite>
      </CurrentURIMetaData>
    </u:SetAVTransportURI>
  </s:Body>
</s:Envelope>
